{"by":"andrewstuart","descendants":11,"id":18022784,"kids":[18027629,18028564,18028056,18026458,18026825,18029866,18023298,18026511,18022874],"score":18,"text":"Folks of HN. I&#x27;m trying to bring my Exidy Sorcerer back to life... &amp; a call for help from anyone who knows anything about (old) electronics.\nYears ago I was lucky enough to buy an old Exidy Sorcerer computer. But I&#x27;ve waited till now to get time to try to bring it back to life.<p>It&#x27;s a beauty, fully kitted out with display, printer, disk drives, manuals and software, in the original boxes!<p>The original box: https:&#x2F;&#x2F;imgur.com&#x2F;5xRFpjH<p>From Exidy, 390 Java Drive, Sunnyvale California! https:&#x2F;&#x2F;imgur.com&#x2F;kagFrCC<p>It&#x27;s a 32K model: https:&#x2F;&#x2F;imgur.com&#x2F;7KFBjaj<p>Inside, the machine under its plastic dust cover: https:&#x2F;&#x2F;imgur.com&#x2F;syAC3mF<p>The dust cover reveals the pristine machine: https:&#x2F;&#x2F;imgur.com&#x2F;MwSLOup<p>Hidden at the bottom of the box, weirdly, a chip! https:&#x2F;&#x2F;imgur.com&#x2F;52V0x3N<p>The original monitor: https:&#x2F;&#x2F;imgur.com&#x2F;qviVnoZ https:&#x2F;&#x2F;imgur.com&#x2F;qviVnoZ<p>Green phosphor no less! https:&#x2F;&#x2F;imgur.com&#x2F;p1NGl2M<p>A bag of cables, including a joystick! https:&#x2F;&#x2F;imgur.com&#x2F;s9kpfwg https:&#x2F;&#x2F;imgur.com&#x2F;eibEq8L<p>The most beautiful floppy disk drives ever made: https:&#x2F;&#x2F;imgur.com&#x2F;ssJq3Wj https:&#x2F;&#x2F;imgur.com&#x2F;1kK3ole https:&#x2F;&#x2F;imgur.com&#x2F;ADqTRum<p>That even have a little dust cover: https:&#x2F;&#x2F;imgur.com&#x2F;fa3kRjD<p>But does this 40 year old machine work?<p>Yes! https:&#x2F;&#x2F;imgur.com&#x2F;8toCU8T<p>In case you weren&#x27;t sure, the stack begins from BF90 hex. https:&#x2F;&#x2F;imgur.com&#x2F;HhcTkSz<p>BUT DISASTER!<p>I plugged it in and turned it on and it worked, but within 60 seconds there was a crackling sound and burning smell and I rapidly turned it off again.<p>OH NO!<p>What do I do? Dear Hacker News community: I’m trying to find someone who can help me with this. I believe the capacitors in these old machines are often a problem. Maybe it&#x27;s that? How do I find someone here in Melbourne, Australia who knows how to replace capacitors in these old machines?<p>Hopefully I can get this beauty back to life and try to preserve the software contained on its floppy disks.","time":1537346499,"title":"Ask HN: Resurrection of Z80 Exidy Sorcerer","type":"story"}