{"by":"whysine","descendants":38,"id":18032209,"kids":[18034357,18033080,18033826,18035015,18032289,18033950,18037088,18033963,18041860,18034979,18032964,18034605,18034778,18034903,18033370,18032283,18034238,18036179],"score":35,"text":"This is the 2nd time in my life that I turn to HN for help. The first time, I already thought I was kind of in a bad shape. But tonight, I reached a new low point. I have been out of a job for a long time. Currently, my only income is from a small remote job that requires no special skills. I can only survive on it, because I moved to a developing country in Southeast Asia. But this is a dead-end. I need to change - everything. I know the best way would be through a job that would allow me to gradually learn new skills. I don&#x27;t really care that much about pay. I can survive on a few hundred dollars a month. Although I would like to say that I&#x27;m willing to do almost anything, I also know my limitations. I previously created some websites on my own using Ruby on Rails. But I&#x27;m probably quite far from a &#x27;real&#x27; hacker who enjoys coding so much, they do it in their free time as well. For me, programming is just a tool to get what I want. Also, I always struggled a lot with front-end development and would often get frustrated when things didn&#x27;t work. I never quite gave up on becoming a real developer - however, at the same time, I never had enough motivation to practice on my own until I would have reached a professional level. I believe the only way would if I could receive a lot of guidance. I did think about attending one of those coding bootcamps, but 1st, they are very expensive, and 2nd, they seem to be high-stress environments - and there is my other big weakness, I really don&#x27;t respond well to stress at all. So, I guess what I&#x27;m hoping to find is some sort of coding internship where I could really very slowly grow into the role - without much pressure. I don&#x27;t know how much sense that makes or if it&#x27;s even remotely realistic. But I just thought I would give it a shot. If anyone thinks there is a chance that they could use my help, please do let me know. My gmail is pnh23can@gmail.com. My native language is German.","time":1537449791,"title":"Ask HN: Reached rock-bottom low point in my life – how to get back up?","type":"story"}