{"by":"zepearl","descendants":7,"id":18035665,"kids":[18035709,18050653,18036648,18048871,18041704],"score":16,"text":"I have always more or less hated accounting, but recently I had to admit that it can be as well very interesting =&gt; therefore yesterday I watched:<p>- &quot;Enron - The smartest guys in the room&quot; (https:&#x2F;&#x2F;www.imdb.com&#x2F;title&#x2F;tt1016268&#x2F;?ref_=nv_sr_1): kind of funny&amp;scary at the same time. It shows the capitalism pushed to its limits; e.g. very interesting and&#x2F;or crazy the fact that (if I understood correctly) they put their &quot;future estimated revenues&quot; into their current balances (even if I can understand their way of thinking being that &quot;the current employees should benefit now for a great idea which might generate returns only in the future&quot; the foundations for the estimation can be only purely speculative).<p>- &quot;Inside Job&quot; (https:&#x2F;&#x2F;www.imdb.com&#x2F;title&#x2F;tt1645089&#x2F;?ref_=nv_sr_1): the explanation about the &quot;Credit Default Swaps&quot; (never heard of CDS until now) was very nice, and the interviews are probably a master example about how things look like when &quot;ethics&quot; don&#x27;t exist. Maybe a bit too heavy on the mix of short sequences of interviews.<p>- &quot;The queen of Versailles&quot; (https:&#x2F;&#x2F;www.imdb.com&#x2F;title&#x2F;tt2125666&#x2F;?ref_=nv_sr_1): this was just crazy, a master example of how money can worsen your life.<p>Any recommendations about other finance docs?<p>E.g. &quot;high frequency trading&quot; sounds interesting =&gt; it might be interesting to know what are the technical quirks, what the people behind it are, etc... .\nOr maybe something that analyzes again more in depth what happend in 2008?\nOr maybe anything that explains well some important concepts of accounting and&#x2F;or finance, based on theory and&#x2F;or historical events?<p>For example I did find by googling &quot;Too big to fail&quot;, &quot;Margin Call&quot; and &quot;The big short&quot; but as they all involve big names (e.g. Christian Bale, Ryan Gosling, Kevin Spacey), I don&#x27;t understand if they&#x27;re fiction or not. I&#x27;m not interested in fiction.<p>Thank you :)","time":1537479334,"title":"Ask HN: Good documentaries about finance?","type":"story"}