{"by":"sleepy_throw","descendants":4,"id":18063696,"kids":[18064654,18064829],"score":9,"text":"I&#x27;m currently reading the book &quot;Why We Sleep&quot;.<p>It lays out a biological truth about sleep cycles that I&#x27;ve experienced for 2-3 decades now: about 30%!o(MISSING)f humanity are night owls, and we have a hard time adjusting to work hours deemed normal by society.<p>I&#x27;m now in my early 30s and have been noticing the negative effects of constant sleep deprivation over the years. My job starts at 9am and I get up at 8am. Naturally, I&#x27;d sleep until 10am. That means I&#x27;m jet lagged by 2 hours every single day. I go to bed around midnight, but can rarely fall asleep until 1-2am. I use a medical grade light box in the morning.<p>The consequences of all the sleep deprivation are pretty dire. I keep getting fatter and feel terrible. It seems to be messing with my digestion. Of course, I&#x27;m constantly tired at work and have to make up the sleep debt on the weekend, which leaves me little time to actually enjoy my days off.<p>I know that it&#x27;s the sleep because I took a sabbatical and lost a ton of weight - and then gained it all back after going back to work. No changes in diet or workout.<p>I&#x27;ve asked about starting work later, but the response was complete non-understanding - my manager seemed offended that I&#x27;d even ask for that, when everyone else was coming in at the same time as me. I didn&#x27;t want to start a huge debate so I wouldn&#x27;t be &quot;that sick guy who wants special treatment&quot;. But I guess I do want &quot;special&quot; treatment so that my schedule won&#x27;t make me sick.<p>How have other night owls dealt with this? If 30%!o(MISSING)f us are late risers, there must be huge demand for jobs that start later. I&#x27;ve never even heard of a job that would let me start late enough to wake up at 10am, except maybe a 100%!r(MISSING)emote job. That would probably severely limit the opportunities and number of jobs available, but I really feel like I can&#x27;t do this to my body much longer - 20s were fine, 30s don&#x27;t seem so fine. Maybe I should prioritize health now?","time":1537851115,"title":"Ask HN: Night owl, health, and career options","type":"story"}