{"by":"genevpd","descendants":31,"id":18067101,"kids":[18075155,18071695,18067106,18071738,18071657,18069815,18069501,18071883],"score":47,"text":"Hey, HN!<p>This post is not about useless meeting tips, nor about some new tool that drains remaining calendar hours.<p>Like most of us, I’m very frustrated by the amount of time wasted by meetings. Why most of us here hate meetings is well described in PG’s essay: <a href=\"http:&#x2F;&#x2F;www.paulgraham.com&#x2F;makersschedule.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.paulgraham.com&#x2F;makersschedule.html</a><p>There is also a great solution that worked for YC: office hours. Ok, but how can this help a regular maker in a regular company?<p>Most makers struggle with the meetings scheduled by their colleagues, so let’s focus just on the company internal meetings.<p>What if every maker will have her&#x2F;his own office hours few times a week at different times? Yeah, that probably won’t work. Makers &amp; managers often need to meet in 2+ groups...<p>OK, what if all makers within the company will have office hours at the same time? Would be nice, but that won’t scale as it will require too many conference rooms and switching rooms fast enough may not be possible if someone has six 10min meetings with different folks…<p>Oh, wait, but what about video meetings? There is no room limit there and switching rooms takes seconds. Many of us work in distributed companies with a lot of meetings online already. Great, but there is still a problem with agreeing on times and booking small meetings within those hours. Also, what to do if there is urgent discussion and everything is overbooked ahead of time with non-urgent managerial stuff?<p>OK, so that is what we are trying to solve with <a href=\"https:&#x2F;&#x2F;www.Meetter.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;www.Meetter.ai</a> and would love to hear what you think about the early version. Please check How Meetter Works section on the landing page for more details.<p>Here is an open demo account just for HN: <a href=\"https:&#x2F;&#x2F;hn.meetter.ai&#x2F;signup-demo\" rel=\"nofollow\">https:&#x2F;&#x2F;hn.meetter.ai&#x2F;signup-demo</a> After sign-up, just try to post few agenda topics with random people and see if you can join office hours scheduled Tue&#x2F;Wed&#x2F;Thu at 8 AM PT.","time":1537889122,"title":"Show HN: Meetter – Reduce time wasted by meetings","type":"story"}