{"by":"saleeh","descendants":57,"id":18075401,"kids":[18075649,18075796,18075805,18076230,18076363,18076152,18080743,18075726,18076191,18076014,18076368,18075776,18076541,18076212,18075508,18075880,18076914,18075653,18075692],"score":87,"text":"Sharing an internal tool that accelerated my development work 10-fold, especially with API debugging. Thought fellow developers here might find it useful.<p>As a developer, I often have trouble reproducing errors at the client end. <a href=\"https:&#x2F;&#x2F;intercept.rest\" rel=\"nofollow\">https:&#x2F;&#x2F;intercept.rest</a> lets me debug and monitor API requests and responses. It is similar to the Network tab in Chrome Developer Tools but works for any API: mobile apps, webhooks, frontend etc.<p>After I shared it with a close circle of friends, they found it incredibly useful and even found new use cases, I never imagined. Been a long time lurker here and have found several such tools that made my life easier. So, wanted to share this here and keen to hear if you folks find it useful too.<p>Some of the Use cases (Look forward to other use cases for this tool):<p>- Reproduce error requests at client side, helps to debug faster.\n– Easily switch between mock, dev, staging and production\n– You can even record requests and run load tests to see how your server behaves when  100,000 hit it\n– debug&#x2F;monitor webhooks. \n– Share requests with the backend team for debugging.<p>If you would like to take it for spin, DM me at <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;intercept_rest\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;intercept_rest</a> , I can hook you up with credits.<p>Also made a blog post on how this tool could be used to monitor network requests in real time. <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;intercept-rest&#x2F;how-to-monitor-network-requests-in-the-app-ce05ed6c5252\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;intercept-rest&#x2F;how-to-monitor-network-req...</a><p>Let me know what you think :) Happy Developing!","time":1537966389,"title":"Show HN: Intercept.rest – Faster API debugging","type":"story"}